OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1787.h
extern __at(0x081F) __sfr PSMC1ASDS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P1ASDSC1             : 1;
  unsigned P1ASDSC2             : 1;
  unsigned P1ASDSC3             : 1;
  unsigned P1ASDSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1ASDSIN             : 1;
  } __PSMC1ASDSbits_t;

extern __at(0x081F) volatile __PSMC1ASDSbits_t PSMC1ASDSbits;

#define _P1ASDSC1               0x02
#define _P1ASDSC2               0x04
#define _P1ASDSC3               0x08
#define _P1ASDSC4               0x10
#define _P1ASDSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC1INT Bits

extern __at(0x0820) __sfr PSMC1INT;

typedef struct
  {
  unsigned P1TPRIF              : 1;
  unsigned P1TDCIF              : 1;
  unsigned P1TPHIF              : 1;
  unsigned P1TOVIF              : 1;
  unsigned P1TPRIE              : 1;
  unsigned P1TDCIE              : 1;
  unsigned P1TPHIE              : 1;
  unsigned P1TOVIE              : 1;
  } __PSMC1INTbits_t;

extern __at(0x0820) volatile __PSMC1INTbits_t PSMC1INTbits;

#define _P1TPRIF                0x01
#define _P1TDCIF                0x02
#define _P1TPHIF                0x04
#define _P1TOVIF                0x08
#define _P1TPRIE                0x10
#define _P1TDCIE                0x20
#define _P1TPHIE                0x40
#define _P1TOVIE                0x80

//==============================================================================

extern __at(0x0821) __sfr PSMC1PH;

//==============================================================================
//        PSMC1PHL Bits

extern __at(0x0821) __sfr PSMC1PHL;

typedef struct
  {
  unsigned PSMC1PH0             : 1;
  unsigned PSMC1PH1             : 1;
  unsigned PSMC1PH2             : 1;
  unsigned PSMC1PH3             : 1;
  unsigned PSMC1PH4             : 1;
  unsigned PSMC1PH5             : 1;
  unsigned PSMC1PH6             : 1;
  unsigned PSMC1PH7             : 1;
  } __PSMC1PHLbits_t;

extern __at(0x0821) volatile __PSMC1PHLbits_t PSMC1PHLbits;

#define _PSMC1PH0               0x01
#define _PSMC1PH1               0x02
#define _PSMC1PH2               0x04
#define _PSMC1PH3               0x08
#define _PSMC1PH4               0x10
#define _PSMC1PH5               0x20
#define _PSMC1PH6               0x40
#define _PSMC1PH7               0x80

//==============================================================================


//==============================================================================
//        PSMC1PHH Bits

extern __at(0x0822) __sfr PSMC1PHH;

typedef struct
  {
  unsigned PSMC1PH8             : 1;
  unsigned PSMC1PH9             : 1;
  unsigned PSMC1PH10            : 1;
  unsigned PSMC1PH11            : 1;
  unsigned PSMC1PH12            : 1;
  unsigned PSMC1PH13            : 1;
  unsigned PSMC1PH14            : 1;
  unsigned PSMC1PH15            : 1;
  } __PSMC1PHHbits_t;

extern __at(0x0822) volatile __PSMC1PHHbits_t PSMC1PHHbits;

#define _PSMC1PH8               0x01
#define _PSMC1PH9               0x02
#define _PSMC1PH10              0x04
#define _PSMC1PH11              0x08
#define _PSMC1PH12              0x10
#define _PSMC1PH13              0x20
#define _PSMC1PH14              0x40
#define _PSMC1PH15              0x80

//==============================================================================

extern __at(0x0823) __sfr PSMC1DC;

//==============================================================================
//        PSMC1DCL Bits

extern __at(0x0823) __sfr PSMC1DCL;

typedef struct
  {
  unsigned PSMC1DC0             : 1;
  unsigned PSMC1DC1             : 1;
  unsigned PSMC1DC2             : 1;
  unsigned PSMC1DC3             : 1;
  unsigned PSMC1DC4             : 1;
  unsigned PSMC1DC5             : 1;
  unsigned PSMC1DC6             : 1;
  unsigned PSMC1DC7             : 1;
  } __PSMC1DCLbits_t;

extern __at(0x0823) volatile __PSMC1DCLbits_t PSMC1DCLbits;

#define _PSMC1DC0               0x01
#define _PSMC1DC1               0x02
#define _PSMC1DC2               0x04
#define _PSMC1DC3               0x08
#define _PSMC1DC4               0x10
#define _PSMC1DC5               0x20
#define _PSMC1DC6               0x40
#define _PSMC1DC7               0x80

//==============================================================================


//==============================================================================
//        PSMC1DCH Bits

extern __at(0x0824) __sfr PSMC1DCH;

typedef struct
  {
  unsigned PSMC1DC8             : 1;
  unsigned PSMC1DC9             : 1;
  unsigned PSMC1DC10            : 1;
  unsigned PSMC1DC11            : 1;
  unsigned PSMC1DC12            : 1;
  unsigned PSMC1DC13            : 1;
  unsigned PSMC1DC14            : 1;
  unsigned PSMC1DC15            : 1;
  } __PSMC1DCHbits_t;

extern __at(0x0824) volatile __PSMC1DCHbits_t PSMC1DCHbits;

#define _PSMC1DC8               0x01
#define _PSMC1DC9               0x02
#define _PSMC1DC10              0x04
#define _PSMC1DC11              0x08
#define _PSMC1DC12              0x10
#define _PSMC1DC13              0x20
#define _PSMC1DC14              0x40
#define _PSMC1DC15              0x80

//==============================================================================

extern __at(0x0825) __sfr PSMC1PR;

//==============================================================================
//        PSMC1PRL Bits

extern __at(0x0825) __sfr PSMC1PRL;

typedef struct
  {
  unsigned PSMC1PR0             : 1;
  unsigned PSMC1PR1             : 1;
  unsigned PSMC1PR2             : 1;
  unsigned PSMC1PR3             : 1;
  unsigned PSMC1PR4             : 1;
  unsigned PSMC1PR5             : 1;
  unsigned PSMC1PR6             : 1;
  unsigned PSMC1PR7             : 1;
  } __PSMC1PRLbits_t;

extern __at(0x0825) volatile __PSMC1PRLbits_t PSMC1PRLbits;

#define _PSMC1PR0               0x01
#define _PSMC1PR1               0x02
#define _PSMC1PR2               0x04
#define _PSMC1PR3               0x08
#define _PSMC1PR4               0x10
#define _PSMC1PR5               0x20
#define _PSMC1PR6               0x40
#define _PSMC1PR7               0x80

//==============================================================================


//==============================================================================
//        PSMC1PRH Bits

extern __at(0x0826) __sfr PSMC1PRH;

typedef struct
  {
  unsigned PSMC1PR8             : 1;
  unsigned PSMC1PR9             : 1;
  unsigned PSMC1PR10            : 1;
  unsigned PSMC1PR11            : 1;
  unsigned PSMC1PR12            : 1;
  unsigned PSMC1PR13            : 1;
  unsigned PSMC1PR14            : 1;
  unsigned PSMC1PR15            : 1;
  } __PSMC1PRHbits_t;

extern __at(0x0826) volatile __PSMC1PRHbits_t PSMC1PRHbits;

#define _PSMC1PR8               0x01
#define _PSMC1PR9               0x02
#define _PSMC1PR10              0x04
#define _PSMC1PR11              0x08
#define _PSMC1PR12              0x10
#define _PSMC1PR13              0x20
#define _PSMC1PR14              0x40
#define _PSMC1PR15              0x80

//==============================================================================

extern __at(0x0827) __sfr PSMC1TMR;

//==============================================================================
//        PSMC1TMRL Bits

extern __at(0x0827) __sfr PSMC1TMRL;

typedef struct
  {
  unsigned PSMC1TMR0            : 1;
  unsigned PSMC1TMR1            : 1;
  unsigned PSMC1TMR2            : 1;
  unsigned PSMC1TMR3            : 1;
  unsigned PSMC1TMR4            : 1;
  unsigned PSMC1TMR5            : 1;
  unsigned PSMC1TMR6            : 1;
  unsigned PSMC1TMR7            : 1;
  } __PSMC1TMRLbits_t;

