OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1787.h
#define IOCCF0                  IOCCFbits.IOCCF0                // bit 0
#define IOCCF1                  IOCCFbits.IOCCF1                // bit 1
#define IOCCF2                  IOCCFbits.IOCCF2                // bit 2
#define IOCCF3                  IOCCFbits.IOCCF3                // bit 3
#define IOCCF4                  IOCCFbits.IOCCF4                // bit 4
#define IOCCF5                  IOCCFbits.IOCCF5                // bit 5
#define IOCCF6                  IOCCFbits.IOCCF6                // bit 6
#define IOCCF7                  IOCCFbits.IOCCF7                // bit 7

#define IOCCN0                  IOCCNbits.IOCCN0                // bit 0
#define IOCCN1                  IOCCNbits.IOCCN1                // bit 1
#define IOCCN2                  IOCCNbits.IOCCN2                // bit 2
#define IOCCN3                  IOCCNbits.IOCCN3                // bit 3
#define IOCCN4                  IOCCNbits.IOCCN4                // bit 4
#define IOCCN5                  IOCCNbits.IOCCN5                // bit 5
#define IOCCN6                  IOCCNbits.IOCCN6                // bit 6
#define IOCCN7                  IOCCNbits.IOCCN7                // bit 7

#define IOCCP0                  IOCCPbits.IOCCP0                // bit 0
#define IOCCP1                  IOCCPbits.IOCCP1                // bit 1
#define IOCCP2                  IOCCPbits.IOCCP2                // bit 2
#define IOCCP3                  IOCCPbits.IOCCP3                // bit 3
#define IOCCP4                  IOCCPbits.IOCCP4                // bit 4
#define IOCCP5                  IOCCPbits.IOCCP5                // bit 5
#define IOCCP6                  IOCCPbits.IOCCP6                // bit 6
#define IOCCP7                  IOCCPbits.IOCCP7                // bit 7

#define IOCEF3                  IOCEFbits.IOCEF3                // bit 3

#define IOCEN3                  IOCENbits.IOCEN3                // bit 3

#define IOCEP3                  IOCEPbits.IOCEP3                // bit 3

#define LATA0                   LATAbits.LATA0                  // bit 0
#define LATA1                   LATAbits.LATA1                  // bit 1
#define LATA2                   LATAbits.LATA2                  // bit 2
#define LATA3                   LATAbits.LATA3                  // bit 3
#define LATA4                   LATAbits.LATA4                  // bit 4
#define LATA5                   LATAbits.LATA5                  // bit 5
#define LATA6                   LATAbits.LATA6                  // bit 6
#define LATA7                   LATAbits.LATA7                  // bit 7

#define LATB0                   LATBbits.LATB0                  // bit 0
#define LATB1                   LATBbits.LATB1                  // bit 1
#define LATB2                   LATBbits.LATB2                  // bit 2
#define LATB3                   LATBbits.LATB3                  // bit 3
#define LATB4                   LATBbits.LATB4                  // bit 4
#define LATB5                   LATBbits.LATB5                  // bit 5
#define LATB6                   LATBbits.LATB6                  // bit 6
#define LATB7                   LATBbits.LATB7                  // bit 7

#define LATC0                   LATCbits.LATC0                  // bit 0
#define LATC1                   LATCbits.LATC1                  // bit 1
#define LATC2                   LATCbits.LATC2                  // bit 2
#define LATC3                   LATCbits.LATC3                  // bit 3
#define LATC4                   LATCbits.LATC4                  // bit 4
#define LATC5                   LATCbits.LATC5                  // bit 5
#define LATC6                   LATCbits.LATC6                  // bit 6
#define LATC7                   LATCbits.LATC7                  // bit 7

#define LATD0                   LATDbits.LATD0                  // bit 0
#define LATD1                   LATDbits.LATD1                  // bit 1
#define LATD2                   LATDbits.LATD2                  // bit 2
#define LATD3                   LATDbits.LATD3                  // bit 3
#define LATD4                   LATDbits.LATD4                  // bit 4
#define LATD5                   LATDbits.LATD5                  // bit 5
#define LATD6                   LATDbits.LATD6                  // bit 6
#define LATD7                   LATDbits.LATD7                  // bit 7

#define LATE0                   LATEbits.LATE0                  // bit 0
#define LATE1                   LATEbits.LATE1                  // bit 1
#define LATE2                   LATEbits.LATE2                  // bit 2

#define ODCONA0                 ODCONAbits.ODCONA0              // bit 0
#define ODCONA1                 ODCONAbits.ODCONA1              // bit 1
#define ODCONA2                 ODCONAbits.ODCONA2              // bit 2
#define ODCONA3                 ODCONAbits.ODCONA3              // bit 3
#define ODCONA4                 ODCONAbits.ODCONA4              // bit 4
#define ODCONA5                 ODCONAbits.ODCONA5              // bit 5
#define ODCONA6                 ODCONAbits.ODCONA6              // bit 6
#define ODCONA7                 ODCONAbits.ODCONA7              // bit 7

#define ODCONB0                 ODCONBbits.ODCONB0              // bit 0
#define ODCONB1                 ODCONBbits.ODCONB1              // bit 1
#define ODCONB2                 ODCONBbits.ODCONB2              // bit 2
#define ODCONB3                 ODCONBbits.ODCONB3              // bit 3
#define ODCONB4                 ODCONBbits.ODCONB4              // bit 4
#define ODCONB5                 ODCONBbits.ODCONB5              // bit 5
#define ODCONB6                 ODCONBbits.ODCONB6              // bit 6
#define ODCONB7                 ODCONBbits.ODCONB7              // bit 7

#define ODCONC0                 ODCONCbits.ODCONC0              // bit 0
#define ODCONC1                 ODCONCbits.ODCONC1              // bit 1
#define ODCONC2                 ODCONCbits.ODCONC2              // bit 2
#define ODCONC3                 ODCONCbits.ODCONC3              // bit 3
#define ODCONC4                 ODCONCbits.ODCONC4              // bit 4
#define ODCONC5                 ODCONCbits.ODCONC5              // bit 5
#define ODCONC6                 ODCONCbits.ODCONC6              // bit 6
#define ODCONC7                 ODCONCbits.ODCONC7              // bit 7

#define ODCOND0                 ODCONDbits.ODCOND0              // bit 0
#define ODCOND1                 ODCONDbits.ODCOND1              // bit 1
#define ODCOND2                 ODCONDbits.ODCOND2              // bit 2
#define ODCOND3                 ODCONDbits.ODCOND3              // bit 3
#define ODCOND4                 ODCONDbits.ODCOND4              // bit 4
#define ODCOND5                 ODCONDbits.ODCOND5              // bit 5
#define ODCOND6                 ODCONDbits.ODCOND6              // bit 6
#define ODCOND7                 ODCONDbits.ODCOND7              // bit 7

#define ODCONE0                 ODCONEbits.ODCONE0              // bit 0
#define ODCONE1                 ODCONEbits.ODCONE1              // bit 1
#define ODCONE2                 ODCONEbits.ODCONE2              // bit 2

