OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1787.h
#define PSMC2PH8                PSMC2PHHbits.PSMC2PH8           // bit 0
#define PSMC2PH9                PSMC2PHHbits.PSMC2PH9           // bit 1
#define PSMC2PH10               PSMC2PHHbits.PSMC2PH10          // bit 2
#define PSMC2PH11               PSMC2PHHbits.PSMC2PH11          // bit 3
#define PSMC2PH12               PSMC2PHHbits.PSMC2PH12          // bit 4
#define PSMC2PH13               PSMC2PHHbits.PSMC2PH13          // bit 5
#define PSMC2PH14               PSMC2PHHbits.PSMC2PH14          // bit 6
#define PSMC2PH15               PSMC2PHHbits.PSMC2PH15          // bit 7

#define PSMC2PH0                PSMC2PHLbits.PSMC2PH0           // bit 0
#define PSMC2PH1                PSMC2PHLbits.PSMC2PH1           // bit 1
#define PSMC2PH2                PSMC2PHLbits.PSMC2PH2           // bit 2
#define PSMC2PH3                PSMC2PHLbits.PSMC2PH3           // bit 3
#define PSMC2PH4                PSMC2PHLbits.PSMC2PH4           // bit 4
#define PSMC2PH5                PSMC2PHLbits.PSMC2PH5           // bit 5
#define PSMC2PH6                PSMC2PHLbits.PSMC2PH6           // bit 6
#define PSMC2PH7                PSMC2PHLbits.PSMC2PH7           // bit 7

#define P2PHST                  PSMC2PHSbits.P2PHST             // bit 0
#define P2PHSC1                 PSMC2PHSbits.P2PHSC1            // bit 1
#define P2PHSC2                 PSMC2PHSbits.P2PHSC2            // bit 2
#define P2PHSC3                 PSMC2PHSbits.P2PHSC3            // bit 3
#define P2PHSC4                 PSMC2PHSbits.P2PHSC4            // bit 4
#define P2PHSIN                 PSMC2PHSbits.P2PHSIN            // bit 7

#define P2POLA                  PSMC2POLbits.P2POLA             // bit 0
#define P2POLB                  PSMC2POLbits.P2POLB             // bit 1
#define P2INPOL                 PSMC2POLbits.P2INPOL            // bit 6

#define PSMC2PR8                PSMC2PRHbits.PSMC2PR8           // bit 0
#define PSMC2PR9                PSMC2PRHbits.PSMC2PR9           // bit 1
#define PSMC2PR10               PSMC2PRHbits.PSMC2PR10          // bit 2
#define PSMC2PR11               PSMC2PRHbits.PSMC2PR11          // bit 3
#define PSMC2PR12               PSMC2PRHbits.PSMC2PR12          // bit 4
#define PSMC2PR13               PSMC2PRHbits.PSMC2PR13          // bit 5
#define PSMC2PR14               PSMC2PRHbits.PSMC2PR14          // bit 6
#define PSMC2PR15               PSMC2PRHbits.PSMC2PR15          // bit 7

#define PSMC2PR0                PSMC2PRLbits.PSMC2PR0           // bit 0
#define PSMC2PR1                PSMC2PRLbits.PSMC2PR1           // bit 1
#define PSMC2PR2                PSMC2PRLbits.PSMC2PR2           // bit 2
#define PSMC2PR3                PSMC2PRLbits.PSMC2PR3           // bit 3
#define PSMC2PR4                PSMC2PRLbits.PSMC2PR4           // bit 4
#define PSMC2PR5                PSMC2PRLbits.PSMC2PR5           // bit 5
#define PSMC2PR6                PSMC2PRLbits.PSMC2PR6           // bit 6
#define PSMC2PR7                PSMC2PRLbits.PSMC2PR7           // bit 7

#define P2PRST                  PSMC2PRSbits.P2PRST             // bit 0
#define P2PRSC1                 PSMC2PRSbits.P2PRSC1            // bit 1
#define P2PRSC2                 PSMC2PRSbits.P2PRSC2            // bit 2
#define P2PRSC3                 PSMC2PRSbits.P2PRSC3            // bit 3
#define P2PRSC4                 PSMC2PRSbits.P2PRSC4            // bit 4
#define P2PRSIN                 PSMC2PRSbits.P2PRSIN            // bit 7

#define P2REBSC1                PSMC2REBSbits.P2REBSC1          // bit 1
#define P2REBSC2                PSMC2REBSbits.P2REBSC2          // bit 2
#define P2REBSC3                PSMC2REBSbits.P2REBSC3          // bit 3
#define P2REBSC4                PSMC2REBSbits.P2REBSC4          // bit 4
#define P2REBSIN                PSMC2REBSbits.P2REBSIN          // bit 7

#define P2STRA                  PSMC2STR0bits.P2STRA            // bit 0
#define P2STRB                  PSMC2STR0bits.P2STRB            // bit 1

#define P2HSMEN                 PSMC2STR1bits.P2HSMEN           // bit 0
#define P2LSMEN                 PSMC2STR1bits.P2LSMEN           // bit 1
#define P2SSYNC                 PSMC2STR1bits.P2SSYNC           // bit 7

#define P2SYNC0                 PSMC2SYNCbits.P2SYNC0           // bit 0
#define P2SYNC1                 PSMC2SYNCbits.P2SYNC1           // bit 1
#define P2SYNC2                 PSMC2SYNCbits.P2SYNC2           // bit 2
#define P2DCPOL                 PSMC2SYNCbits.P2DCPOL           // bit 5
#define P2PRPOL                 PSMC2SYNCbits.P2PRPOL           // bit 6
#define P2POFST                 PSMC2SYNCbits.P2POFST           // bit 7

#define PSMC2TMR8               PSMC2TMRHbits.PSMC2TMR8         // bit 0
#define PSMC2TMR9               PSMC2TMRHbits.PSMC2TMR9         // bit 1
#define PSMC2TMR10              PSMC2TMRHbits.PSMC2TMR10        // bit 2
#define PSMC2TMR11              PSMC2TMRHbits.PSMC2TMR11        // bit 3
#define PSMC2TMR12              PSMC2TMRHbits.PSMC2TMR12        // bit 4
#define PSMC2TMR13              PSMC2TMRHbits.PSMC2TMR13        // bit 5
#define PSMC2TMR14              PSMC2TMRHbits.PSMC2TMR14        // bit 6
#define PSMC2TMR15              PSMC2TMRHbits.PSMC2TMR15        // bit 7

#define PSMC2TMR0               PSMC2TMRLbits.PSMC2TMR0         // bit 0
#define PSMC2TMR1               PSMC2TMRLbits.PSMC2TMR1         // bit 1
#define PSMC2TMR2               PSMC2TMRLbits.PSMC2TMR2         // bit 2
#define PSMC2TMR3               PSMC2TMRLbits.PSMC2TMR3         // bit 3
#define PSMC2TMR4               PSMC2TMRLbits.PSMC2TMR4         // bit 4
#define PSMC2TMR5               PSMC2TMRLbits.PSMC2TMR5         // bit 5
#define PSMC2TMR6               PSMC2TMRLbits.PSMC2TMR6         // bit 6
#define PSMC2TMR7               PSMC2TMRLbits.PSMC2TMR7         // bit 7

#define P3ASDOV                 PSMC3ASDCbits.P3ASDOV           // bit 0
#define P3ARSEN                 PSMC3ASDCbits.P3ARSEN           // bit 5
#define P3ASDEN                 PSMC3ASDCbits.P3ASDEN           // bit 6
#define P3ASE                   PSMC3ASDCbits.P3ASE             // bit 7

#define P3ASDLA                 PSMC3ASDLbits.P3ASDLA           // bit 0
#define P3ASDLB                 PSMC3ASDLbits.P3ASDLB           // bit 1
#define P3ASDLC                 PSMC3ASDLbits.P3ASDLC           // bit 2
#define P3ASDLD                 PSMC3ASDLbits.P3ASDLD           // bit 3
#define P3ASDLE                 PSMC3ASDLbits.P3ASDLE           // bit 4
#define P3ASDLF                 PSMC3ASDLbits.P3ASDLF           // bit 5

#define P3ASDSC1                PSMC3ASDSbits.P3ASDSC1          // bit 1
#define P3ASDSC2                PSMC3ASDSbits.P3ASDSC2          // bit 2
#define P3ASDSC3                PSMC3ASDSbits.P3ASDSC3          // bit 3
#define P3ASDSC4                PSMC3ASDSbits.P3ASDSC4          // bit 4
#define P3ASDSIN                PSMC3ASDSbits.P3ASDSIN          // bit 7

#define PSMC3BLKF0              PSMC3BLKFbits.PSMC3BLKF0        // bit 0
#define PSMC3BLKF1              PSMC3BLKFbits.PSMC3BLKF1        // bit 1
#define PSMC3BLKF2              PSMC3BLKFbits.PSMC3BLKF2        // bit 2
#define PSMC3BLKF3              PSMC3BLKFbits.PSMC3BLKF3        // bit 3
#define PSMC3BLKF4              PSMC3BLKFbits.PSMC3BLKF4        // bit 4
#define PSMC3BLKF5              PSMC3BLKFbits.PSMC3BLKF5        // bit 5
#define PSMC3BLKF6              PSMC3BLKFbits.PSMC3BLKF6        // bit 6
#define PSMC3BLKF7              PSMC3BLKFbits.PSMC3BLKF7        // bit 7

#define PSMC3BLKR0              PSMC3BLKRbits.PSMC3BLKR0        // bit 0
#define PSMC3BLKR1              PSMC3BLKRbits.PSMC3BLKR1        // bit 1
#define PSMC3BLKR2              PSMC3BLKRbits.PSMC3BLKR2        // bit 2
#define PSMC3BLKR3              PSMC3BLKRbits.PSMC3BLKR3        // bit 3
#define PSMC3BLKR4              PSMC3BLKRbits.PSMC3BLKR4        // bit 4
#define PSMC3BLKR5              PSMC3BLKRbits.PSMC3BLKR5        // bit 5
#define PSMC3BLKR6              PSMC3BLKRbits.PSMC3BLKR6        // bit 6
#define PSMC3BLKR7              PSMC3BLKRbits.PSMC3BLKR7        // bit 7

#define P3REBM0                 PSMC3BLNKbits.P3REBM0           // bit 0
#define P3REBM1                 PSMC3BLNKbits.P3REBM1           // bit 1
#define P3FEBM0                 PSMC3BLNKbits.P3FEBM0           // bit 4
#define P3FEBM1                 PSMC3BLNKbits.P3FEBM1           // bit 5

#define P3CSRC0                 PSMC3CLKbits.P3CSRC0            // bit 0
#define P3CSRC1                 PSMC3CLKbits.P3CSRC1            // bit 1
#define P3CPRE0                 PSMC3CLKbits.P3CPRE0            // bit 4
#define P3CPRE1                 PSMC3CLKbits.P3CPRE1            // bit 5

#define P3MODE0                 PSMC3CONbits.P3MODE0            // bit 0
#define P3MODE1                 PSMC3CONbits.P3MODE1            // bit 1
#define P3MODE2                 PSMC3CONbits.P3MODE2            // bit 2
#define P3MODE3                 PSMC3CONbits.P3MODE3            // bit 3
#define P3DBRE                  PSMC3CONbits.P3DBRE             // bit 4
#define P3DBFE                  PSMC3CONbits.P3DBFE             // bit 5
#define PSMC3LD                 PSMC3CONbits.PSMC3LD            // bit 6
#define PSMC3EN                 PSMC3CONbits.PSMC3EN            // bit 7

